Revit 2027 API
Material.Create Method
 Creates a new material.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId Create(
	Document document,
	string name
)
Public Shared Function Create (
	document As Document,
	name As String
) As ElementId
public:
static ElementId^ Create(
	Document^ document,
	String^ name
)
static member Create :
        document : Document *
        name : string -> ElementId
Parameters
document Document
 The document in which to create the material.
name String
 The name of the new material.
Return Value
ElementId
 Identifier of the new material.
Exceptions
Exception | Condition
ArgumentException |  name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- The given value for name is already in use as a material element name.
ArgumentNullException |  A non-optional argument was null
Example
//Create the material
ElementId materialId = Material.Create(document, "My Material");
Material material = document.GetElement(materialId) as Material;
//Create a new property set that can be used by this material
StructuralAsset strucAsset = new StructuralAsset("My Property Set", StructuralAssetClass.Concrete);
strucAsset.Behavior = StructuralBehavior.Isotropic;
strucAsset.Density = 232.0;
//Assign the property set to the material.
PropertySetElement pse = PropertySetElement.Create(document, strucAsset);
material.SetMaterialAspectByPropertySet(MaterialAspect.Structural, pse.Id);
See Also
Reference
Material Class
Autodesk.Revit.DB Namespace